frontend/controllers/GoodsController.php

    public function actionGetgoods()
    {
        Yii::info('获取商品详情:', 'info');
        $post = Yii::$app->request->post();
        if(empty($post['goods_id'])){
            MobileApi::RetEcho(MobileErr::POST_LOSE, '参数缺失');die;
        }
        $goods = (new UniversalDb('db'))->setTableName('shop_goods')
                     ->find()
                     ->select('goods_id,cat_id,goods_sn,goods_name,goods_stock,goods_price,goods_img,is_best,is_new,is_hot,is_promote,region_name')
                     ->where(['goods_id' => $post['goods_id']])
                     ->asArray()
                     ->one();

        if(empty($goods)){
             MobileApi::RetEcho(MobileErr::DATA_NON, '商品不存在');die;
        }
        $goods['goods_img'] = \Yii::$app->params['pic_host'].$goods['goods_img'];
        $goods['piclist'][] = $goods['goods_img'];
        unset($goods['goods_img']);
        $goods['goods_cont_url'] = Yii::$app->request->hostInfo.\Yii::$app->urlManager->createUrl(['content/cont']).'?goodsid='.$goods['goods_id'].'&goods_type=shop';
         //商品属性
        $goodsId = $post['goods_id'];
        $query = new \yii\db\Query();
        $data['attrlist'] = $query->select("*")
            ->from('shop_goods_mutil_prise sgmp')
            ->where("sgmp.gmp_goods_id = $goodsId")
            ->all();
---
SELECT `goods_id`, `cat_id`, `goods_sn`, `goods_name`, `goods_stock`, `goods_price`, `goods_img`, `is_best`, `is_new`, `is_hot`, `is_promote`, `region_name` FROM `shop_goods` WHERE `goods_id`='4611'
SELECT * FROM `shop_goods_mutil_prise` `sgmp` WHERE sgmp.gmp_goods_id = 4611

                        $arr[$k][] = $c[1];
                    }
                }
                $tag[] = $query->select("ga.attr_name")->from('goods_attribute ga')->where("ga.attr_id = $v")->one();
---
SELECT `ga`.`attr_name` FROM `goods_attribute` `ga` WHERE ga.attr_id = 1