frontend/models/UShopGoods.php

    public static function _get_likedata($condition,$search,$startpage,$pagesize)
    {
        try {
            $dbSource = parent::find();
            $dbSource->select(['goods_id','cat_id','goods_sn','goods_name','goods_stock','goods_price','goods_img','is_best','is_state','is_delete','is_new','is_hot','goods_sales','is_promote','region_name']);
            $dbSource->where($condition);
            if (!empty($search)) {
                $dbSource->andWhere(['like', 'goods_name', $search]);
            }
            $dbSource->offset($startpage);
            $dbSource->limit($pagesize);
            Yii::info('从mysql取数据:'.$dbSource->createCommand()->getRawSql(), 'info');
           //echo $dbSource->createCommand()->getRawSql();
            return $dbSource->all();
---
SELECT `goods_id`, `cat_id`, `goods_sn`, `goods_name`, `goods_stock`, `goods_price`, `goods_img`, `is_best`, `is_state`, `is_delete`, `is_new`, `is_hot`, `goods_sales`, `is_promote`, `region_name` FROM `shop_goods` WHERE ((`is_state`=1) AND (`is_delete`=0) AND (`is_promote`=0)) AND (`goods_name` LIKE '%号%') LIMIT 10